

char a = '1';
string a = '1';



int a = 3;
float b = 3;
double c = 3;



int a, b;
cin >> a >> b;
if (a > b){
    cout << a;
}
if (a < b){
    cout << b;
}



for (int i = 0; i < n; i += 2){
    cout << i << " ";
}



Вывести все четные числа от 0 до 100




Ввести число и используя цикл(любой), определить
все четные числа от 0, вывести и посчитать их
количество



a[i] = 1

Вводиться массив размером n. Найти сумму и 
произведение всех элементов массива.







































Вводиться двумерный массив размером n * m. Написать программу,
которая выведет максимум каждой строки, каждого столбца.




Написать программу, которая будет менять максимальный элемент
массива, на минимальный элемент этого же массива

9 5 5 -> 5 5 5
1 4 14 6 -> 1 4 1 6
